In [19]:
import json

with open('dwsample1-json.json') as f:
    data= json.load(f)

print(data)

{'fruit': ['Apple'], 'size': ['Large'], 'color': ['Red']}

In [20]:
import pandas as pd
from pandas import DataFrame
bank=pd.read_csv('bank2.csv')
bank.head()

,CustomerID,Name,Surname,Gender,Age,Region,JobClassification,DateJoined,Balance
0,100000001,Simon,Walsh,Male,21,England,White Collar,05.Jan.15,113810.15
1,400000002,Jasmine,Miller,Female,34,Northern Ireland,Blue Collar,06.Jan.15,36919.73
2,100000003,Liam,Brown,Male,46,England,White Collar,07.Jan.15,101536.83
3,300000004,Trevor,Parr,Male,32,Wales,White Collar,08.Jan.15,1421.52
4,100000005,Deirdre,Pullman,Female,38,England,Blue Collar,09.Jan.15,35639.79

In [21]:
import pandas as pd
df=pd.read_table("sample3.txt")
print(df)

                                                  hii
0                                           everyone
1                        Quod equidem non reprehendo;
2   Lorem ipsum dolor sit amet, consectetur adipis...
3   Iam id ipsum absurdum, maximum malum neglegi. ...
4                           Quis istum dolorem timet?
5   Summus dolor plures dies manere non potest? Di...
6   Ex eorum enim scriptis et institutis cum omnis...
7   Quod si ita est, sequitur id ipsum, quod te ve...
8   Quem si tenueris, non modo meum Ciceronem, sed...
9   Stulti autem malorum memoria torquentur, sapie...
10  Esse enim quam vellet iniquus iustus poterat i...
11  Quae autem natura suae primae institutionis ob...
12  Verum tamen cum de rebus grandioribus dicas, i...
13  Hoc est non modo cor non habere, sed ne palatu...
14  Voluptatem cum summum bonum diceret, primum in...
15                              Idemne, quod iucunde?
16  Haec mihi videtur delicatior, ut ita dicam, mo...

In [22]:
import pandas as pd
iris=pd.read_csv('iris.csv')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [23]:
iris['petal_length']

0      1.4
1      1.4
2      1.3
3      1.5
4      1.4
      ...
145    5.2
146    5.0
147    5.2
148    5.4
149    5.1
Name: petal_length, Length: 150, dtype: float64

In [24]:
#import numpy as np
iris['petal_length'].mean()

3.7586666666666693

In [25]:
iris.shape

(150, 5)

In [26]:
len(iris.columns)

5

In [27]:
len(iris)

150

In [28]:
iris.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.054000      3.758667     1.198667     NaN
std         0.828066     0.433594      1.764420     0.763161     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [29]:
import pandas as pd
import json
data=pd.read_json('dwsample1-json.json')
data.head()

   fruit   size color
0  Apple  Large   Red

In [30]:
iris[['sepal_length','sepal_width','petal_length','petal_width']].std()

sepal_length    0.828066
sepal_width     0.433594
petal_length    1.764420
petal_width     0.763161
dtype: float64

In [34]:
grouped=iris.groupby('species')
stdev=grouped.apply(lambda x:x.std(numeric_only=True))
print(stdev)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          0.352490     0.381024      0.173511     0.107210
versicolor      0.516171     0.313798      0.469911     0.197753
virginica       0.635880     0.322497      0.551895     0.274650

In [36]:
mean=iris['petal_length'].mean()
print(mean)
fifty=mean*(50/100)
avg=fifty+mean

3.7586666666666693

In [37]:
print(iris[iris.petal_length>avg])

     sepal_length  sepal_width  petal_length  petal_width    species
100           6.3          3.3           6.0          2.5  virginica
102           7.1          3.0           5.9          2.1  virginica
104           6.5          3.0           5.8          2.2  virginica
105           7.6          3.0           6.6          2.1  virginica
107           7.3          2.9           6.3          1.8  virginica
108           6.7          2.5           5.8          1.8  virginica
109           7.2          3.6           6.1          2.5  virginica
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
120           6.9          3.2           5.7          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
124           6.7          3.3           5.7          2.1  virginica
125           7.2          3.2           6.0          1.8  virginica
129           7.2          3.0           5.8          1.6  virginica
130           7.4          2.8           6.1          1.9  virginica
131           7.9          3.8           6.4          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica